Feature: Добавяне на проект
  Scenario: Добавяне на проект с име, мениджър и разработчици
    Given Потребителя отваря екрана за добавяне на проект
    When Въвежда име на проекта "WebApp"
    And Въвежда име на мениджъра "Ivan Ivanov"
    And Въвежда списък с разработчици
      | Ivan Georgiev | Georgi Georgiev |
    And Натиска бутона за добавяне на проекта
    Then Вижда съобщение "Успешно добавихте проекта"

  Scenario: Добавяне на проект без име
    Given Потребителя отваря екрана за добавяне на проект
    When Въвежда име на мениджъра "Ivan Ivanov"
    And Въвежда списък с разработчици
      | Ivan Georgiev | Georgi Georgiev |
    And Натиска бутона за добавяне на проекта
    Then Вижда съобщение "Моля въведете име на проекта"

  Scenario: Добавяне на проект без мениджър
    Given Потребителя отваря екрана за добавяне на проект
    When Въвежда име на проекта "WebApp"
    And Въвежда списък с разработчици
      | Ivan Georgiev | Georgi Georgiev |
    And Натиска бутона за добавяне на проекта
    Then Вижда съобщение "Моля въведете мениджър на проекта"

  Scenario: Добавяне на проект с несъществутащ мениджър
    Given Потребителя отваря екрана за добавяне на проект
    When Въвежда име на проекта "WebApp"
    And Въвежда име на мениджъра "Test"
    And Въвежда списък с разработчици
      | Ivan Georgiev | Georgi Georgiev |
    And Натиска бутона за добавяне на проекта
    Then Вижда съобщение "Мениджъра не съществува"

  Scenario: Добавяне на проект без разработчици
    Given Потребителя отваря екрана за добавяне на проект
    When Въвежда име на проекта "WebApp"
    And Въвежда име на мениджъра "Ivan Ivanov"
    And Натиска бутона за добавяне на проекта
    Then Вижда съобщение "Моля въведете разработчици за проекта"